InformationRegisters/CRM_СтатусыКлиентскихЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_СтатусыКлиентскихЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыКлиентскихЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлиентскаяЗаявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_КлиентскаяЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_СтатусыКлиентскихЗаявок/Ext/ManagerModule.bsl
Процедура УстановитьСтатусЗаявки(КлиентскаяЗаявка, Статус) Экспорт 
	
	НаборЗаписей = РегистрыСведений.CRM_СтатусыКлиентскихЗаявок.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.КлиентскаяЗаявка.Установить(КлиентскаяЗаявка);
	
	НаборЗаписей.Прочитать();
	
	НовЗапись = НаборЗаписей.Добавить();
	
	НовЗапись.Период = ТекущаяДата();
	НовЗапись.КлиентскаяЗаявка = КлиентскаяЗаявка;
	НовЗапись.Статус = Статус;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьСтатусЗаявки(КлиентскаяЗаявка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_СтатусыКлиентскихЗаявокСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.CRM_СтатусыКлиентскихЗаявок.СрезПоследних(, КлиентскаяЗаявка = &КлиентскаяЗаявка) КАК CRM_СтатусыКлиентскихЗаявокСрезПоследних";
	
	Запрос.УстановитьПараметр("КлиентскаяЗаявка", КлиентскаяЗаявка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
	
		Возврат	Выборка.Статус;
		
	Иначе 
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции
